; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	infrared3 - mode
	infrared2 - mode
	image1 - mode
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 141)
	(= (data Planet3 infrared0) 25)
	(= (data Star4 infrared0) 142)
	(= (data Phenomenon5 infrared0) 255)
	(= (data Star6 infrared0) 48)
	(= (data Phenomenon7 infrared0) 175)
	(= (data Phenomenon8 infrared0) 159)
	(= (data Planet3 infrared3) 261)
	(= (data Star4 infrared3) 204)
	(= (data Phenomenon5 infrared3) 258)
	(= (data Star6 infrared3) 49)
	(= (data Phenomenon7 infrared3) 161)
	(= (data Phenomenon8 infrared3) 27)
	(= (data Planet3 infrared2) 32)
	(= (data Star4 infrared2) 223)
	(= (data Phenomenon5 infrared2) 248)
	(= (data Star6 infrared2) 14)
	(= (data Phenomenon7 infrared2) 256)
	(= (data Phenomenon8 infrared2) 299)
	(= (data Planet3 image1) 190)
	(= (data Star4 image1) 264)
	(= (data Phenomenon5 image1) 291)
	(= (data Star6 image1) 105)
	(= (data Phenomenon7 image1) 58)
	(= (data Phenomenon8 image1) 83)
	(= (slew_time Star2 GroundStation0) 6.785)
	(= (slew_time GroundStation0 Star2) 6.785)
	(= (slew_time Star2 GroundStation1) 59.14)
	(= (slew_time GroundStation1 Star2) 59.14)
	(= (slew_time GroundStation1 GroundStation0) 33.78)
	(= (slew_time GroundStation0 GroundStation1) 33.78)
	(= (slew_time Planet3 GroundStation0) 30.1)
	(= (slew_time GroundStation0 Planet3) 30.1)
	(= (slew_time Planet3 GroundStation1) 3.434)
	(= (slew_time GroundStation1 Planet3) 3.434)
	(= (slew_time Planet3 Star2) 74.91)
	(= (slew_time Star2 Planet3) 74.91)
	(= (slew_time Star4 GroundStation0) 56.48)
	(= (slew_time GroundStation0 Star4) 56.48)
	(= (slew_time Star4 GroundStation1) 9.694)
	(= (slew_time GroundStation1 Star4) 9.694)
	(= (slew_time Star4 Star2) 26.83)
	(= (slew_time Star2 Star4) 26.83)
	(= (slew_time Star4 Planet3) 0.2049)
	(= (slew_time Planet3 Star4) 0.2049)
	(= (slew_time Phenomenon5 GroundStation0) 10.6)
	(= (slew_time GroundStation0 Phenomenon5) 10.6)
	(= (slew_time Phenomenon5 GroundStation1) 83.93)
	(= (slew_time GroundStation1 Phenomenon5) 83.93)
	(= (slew_time Phenomenon5 Star2) 10.01)
	(= (slew_time Star2 Phenomenon5) 10.01)
	(= (slew_time Phenomenon5 Planet3) 87.8)
	(= (slew_time Planet3 Phenomenon5) 87.8)
	(= (slew_time Phenomenon5 Star4) 18.22)
	(= (slew_time Star4 Phenomenon5) 18.22)
	(= (slew_time Star6 GroundStation0) 82.29)
	(= (slew_time GroundStation0 Star6) 82.29)
	(= (slew_time Star6 GroundStation1) 9.136)
	(= (slew_time GroundStation1 Star6) 9.136)
	(= (slew_time Star6 Star2) 9.449)
	(= (slew_time Star2 Star6) 9.449)
	(= (slew_time Star6 Planet3) 83.53)
	(= (slew_time Planet3 Star6) 83.53)
	(= (slew_time Star6 Star4) 22.71)
	(= (slew_time Star4 Star6) 22.71)
	(= (slew_time Star6 Phenomenon5) 5.649)
	(= (slew_time Phenomenon5 Star6) 5.649)
	(= (slew_time Phenomenon7 GroundStation0) 71.08)
	(= (slew_time GroundStation0 Phenomenon7) 71.08)
	(= (slew_time Phenomenon7 GroundStation1) 1.9)
	(= (slew_time GroundStation1 Phenomenon7) 1.9)
	(= (slew_time Phenomenon7 Star2) 69.54)
	(= (slew_time Star2 Phenomenon7) 69.54)
	(= (slew_time Phenomenon7 Planet3) 10.2)
	(= (slew_time Planet3 Phenomenon7) 10.2)
	(= (slew_time Phenomenon7 Star4) 29.97)
	(= (slew_time Star4 Phenomenon7) 29.97)
	(= (slew_time Phenomenon7 Phenomenon5) 36.13)
	(= (slew_time Phenomenon5 Phenomenon7) 36.13)
	(= (slew_time Phenomenon7 Star6) 43.82)
	(= (slew_time Star6 Phenomenon7) 43.82)
	(= (slew_time Phenomenon8 GroundStation0) 81.99)
	(= (slew_time GroundStation0 Phenomenon8) 81.99)
	(= (slew_time Phenomenon8 GroundStation1) 39.6)
	(= (slew_time GroundStation1 Phenomenon8) 39.6)
	(= (slew_time Phenomenon8 Star2) 5.925)
	(= (slew_time Star2 Phenomenon8) 5.925)
	(= (slew_time Phenomenon8 Planet3) 31.04)
	(= (slew_time Planet3 Phenomenon8) 31.04)
	(= (slew_time Phenomenon8 Star4) 13.83)
	(= (slew_time Star4 Phenomenon8) 13.83)
	(= (slew_time Phenomenon8 Phenomenon5) 0.4932)
	(= (slew_time Phenomenon5 Phenomenon8) 0.4932)
	(= (slew_time Phenomenon8 Star6) 4.547)
	(= (slew_time Star6 Phenomenon8) 4.547)
	(= (slew_time Phenomenon8 Phenomenon7) 32.24)
	(= (slew_time Phenomenon7 Phenomenon8) 32.24)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(have_image Planet3 infrared3)
	(have_image Star4 infrared3)
	(have_image Star6 infrared3)
	(have_image Phenomenon7 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation1 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 141 to 137.566, (fuel-used) from 0 to 3.434
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 137.566 to 135.666, (fuel-used) from 3.434 to 5.334
   goals met: 0 of 5
5. (take_image satellite0 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   changed: (data_capacity satellite0) from 1000 to 942, (data-stored) from 0 to 58
   goals met: 1 of 5
6. (turn_to satellite0 groundstation1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 135.666 to 133.766, (fuel-used) from 5.334 to 7.234
   goals met: 1 of 5
7. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 133.766 to 124.63, (fuel-used) from 7.234 to 16.37
   goals met: 1 of 5
8. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 124.63 to 115.494, (fuel-used) from 16.37 to 25.506
   goals met: 1 of 5
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 5
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 5
12. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 115.494 to 106.358, (fuel-used) from 25.506 to 34.642
   goals met: 1 of 5
13. (take_image satellite0 star6 instrument0 infrared3)
   added: (have_image star6 infrared3)
   changed: (data_capacity satellite0) from 942 to 893, (data-stored) from 58 to 107
   goals met: 2 of 5
14. (turn_to satellite0 planet3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 106.358 to 22.828, (fuel-used) from 34.642 to 118.172
   goals met: 2 of 5
15. (take_image satellite0 planet3 instrument0 infrared3)
   added: (have_image planet3 infrared3)
   changed: (data_capacity satellite0) from 893 to 632, (data-stored) from 107 to 368
   goals met: 3 of 5
16. (turn_to satellite0 star4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 22.828 to 22.6231, (fuel-used) from 118.172 to 118.377
   goals met: 3 of 5
17. (take_image satellite0 star4 instrument0 infrared3)
   added: (have_image star4 infrared3)
   changed: (data_capacity satellite0) from 632 to 428, (data-stored) from 368 to 572
   goals met: 4 of 5
18. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 22.6231 to 4.4031, (fuel-used) from 118.377 to 136.597
   goals met: 5 of 5
